Repository: GunioRobot/interchange
Catalog: debian/po/*.po
Languages: it, sv, vi

source: Create the Interchange demo catalog?
it: Creare il catalogo dimostrativo di Interchange?
sv: Skapa demokatalog för Interchange?
vi: Tạo phân loại chứng minh Interchange (trao đổi lẫn nhau) không?

source: Whether to install the demo catalog from the standard template or let you manually install it with makecat.
it: Se installare il catalogo dimostrativo partendo dal modello standard o lasciare che l'utente lo crei manualmente usando makecat.

source: Remove demo catalog on package purge?
it: Rimuovere il catalogo dimostrativo con l'eliminazione del pacchetto?
sv: Ta bort demokatalog vid avinstallation av paketet?
vi: Loại bỏ phân loại chứng minh khi tẩy gói tin này không?

source: Should all files belonging to the Interchange demo catalog removed when you purge this package, e.g. with dpkg --purge or apt-get remove --purge ?
it: I file che appartengono al catalogo dimostrativo di Interchange devono essere rimossi quando si elimina questo pacchetto, cioè con dpkg --purge o apt get remove --purge?
sv: Ska alla filer som tillhör Interchanges demokatalog tas bort när du rensar detta paket, exempelvis med dpkg --purge eller apt-get remove --purge?
vi: Nên loại bỏ mọi tập tin thuộc về phân loại chứng minh Interchange khi bạn tẩy gói tin này (v.d. dùng «dpkg --purge» «apt-get remove --purge») không?

source: always, ask, never
it: sempre, chiedi, mai
sv: alltid, fråga, aldrig
vi: luôn, xin hỏi, không bao giờ,

source: Policy for replacing existing demo catalogs:
it: Regola per sostituire i cataloghi dimostrativi esistenti:
sv: Policy för ersättande av existerande demokataloger:
vi: Chính thức về thay thế phân loại chứng minh đã có:

source: Whether to silently replace an existing demo catalog installation, ask for a confirmation or never touch an existing installation.
it: Se sostituire automaticamente un'installazione di catalogo dimostrativo, chiedere conferma, o se non modificare mai un'installazione esistente.
sv: Hur tyst ersättning av existerande installation av demokatalog ska göras, fråga efter bekräftelse eller rör aldrig en existerande installation.
vi: Nên thay thế một bản cài đặt phân loại chứng minh đã có một cách im (không thông báo gì), xin hỏi bạn xác nhận, hoặc không bao giờ sửa đổi một bản cài đặt đã có?

source: Replace the Interchange demo catalog?
it: Sostituire il catalogo dimostrativo di Interchange?
sv: Ersätt Interchanges demokatalog?
vi: Thay thế phân loại chứng minh Interchange không?

source: There seems to already exist an Interchange demo catalog.
it: Sembra che un catalogo dimostrativo di Interchange esista già.
sv: Det verkar redan existera en demokatalog för Interchange.
vi: Hình như có một phân loại chứng minh Interchange rồi.

source: You are running Interchange with "FullURL" enabled. Please specify the virtual host for the demo catalog.
it: Interchange è in esecuzione con l'opzione "FullURL" abilitata. Specificare l'host virtuale per il catalogo dimostrativo.

source: Username for this catalog's administration:
it: Nome utente per l'amministrazione di questo catalogo:
sv: Användarnamn för administration av denna katalog:
vi: Tên người dùng để quản lý phân loại này:

source: Please provide an username for administering the demo catalog. The username must be at least 2 characters long and only contain letters, digits, underscore, @ or the dot as characters.
it: Fornire un nome utente per amministrare il catalogo dimostrativo. Il nome utente deve consistere di almeno 2 caratteri e può contenere solo lettere, numeri, sottolineatura, @ o punto.
sv: Vänligen ange ett användarnamn för administration av demokatalogen. Användarnamnet måste vara åtminstone två tecken långt och får endast innehålla bokstäver, siffror, understreck, @ eller en punkt.
vi: Hãy cung cấp một tên người dùng để quản lý phân loại chứng minh ấy. Tên người dùng phải có ít nhất 2 ký tự và chỉ cho phép chứa chữ, số, dấu_gạch, dấu @-còng hay dấu.chấm là ký tự.

source: Password for this catalog's administration:
it: Password per l'amministrazione di questo catalogo:
sv: Lösenord för administration av denna katalog:
vi: Mật khẩu để quản lý phân loại này:

source: Please provide a password for administering the standard demo catalog. Choose one which can not be easily guessed. Default is pass. The password must be at least 4 characters long and only contain letters, digits, underscore @ or the dot as characters.
it: Fornire una password per amministrare il catalogo dimostrativo standard. Scegliere una password che non possa essere facilmente indovinata. La password predefinita è pass. La password deve consistere di almeno 4 caratteri e può contenere solo lettere, numeri, sottolineatura, @ o punto.

source: Enable demo mode?
it: Abilitare la modalità di dimostrazione?
sv: Aktivera demoläge?
vi: Bật chế độ chứng minh không?

source: Additional locales for the storefront:
it: Lingue addizionali per l'interfaccia del negozio:
sv: Ytterligare lokalanpassningar för butiken:
vi: Miền địa phương thêm cho mặt hàng:

source: The Interchange demo catalog is able to display the storefront in a number of different languages. Each selected locale will increase the memory footprint of the Interchange server processes, so it is recommended to choose only locales which are really needed.
it: Il catalogo dimostrativo di Interchange è in grado di mostrare l'interfaccia del negozio in diverse lingue. Ogni lingua selezionata aumenterà la quantità di memoria usata dai processi server di Interchange, per cui si raccomanda di scegliere solo le lingue veramente necessarie.
sv: Demokatalogen i Interchange kan visa butiken på ett antal olika språk. Varje vald lokal kommer att öka minnesbelastningen på Interchange-serverns processer, det är rekommanderat att välja endast de lokaler som verkligen behövs.
vi: Phân loại chứng minh Interchange có thể hiển thị mặt hàng bằng một số ngôn ngữ khác. Mỗi miền địa phương đã chọn ở đây thì sẽ tăng cỡ dấu chân bộ nhớ của những tiến trình của trình phục vụ Interchange địa phương, vì vậy khuyến khích bạn chọn chỉ những miền địa phương cần đến.

source: Default locale for the storefront:
it: Lingua predefinita per l'interfaccia del negozio:
sv: Förvald lokal för butiken:
vi: Miền địa phương mặc định cho mặt hàng:

source: Please select the default locale for the Interchange demo catalog.
it: Selezionare la lingua predefinita per il catalogo dimostrativo di Interchange.
sv: Välj den förvalda lokalen för Interchanges demokatalog.
vi: Hãy chọn miền địa phương mặc định cho phân loại chứng minh Interchannge.

source: Please select the name of the database.
it: Selezionare il nome del database.

source: Please specify the username for connecting to the database.
it: Specificare il nome utente che sarà utilizzato per collegarsi al database.

source: Please specify the password for connecting to the database.
it: Specificare la password che sarà utilizzata per collegarsi al database.

source: unix mode, internet mode, both
it: modo Unix, modo Internet, entrambi
sv: Unix-läge, Internet-läge, Båda
vi: chế độ Unix, chế độ Mạng, cả hai điều

source: Start mode:
it: Modo di avvio:
sv: Startläge:
vi: Chế độ bắt đầu:

source: Unix mode is is the most secure way to run Interchange, for there is no way for systems on the internet to interact with the Interchange server.
it: Il modo Unix è quello più sicuro per eseguire Interchange, in quanto non c'è modo che sistemi in Internet interagiscano con il server di Interchange.
sv: Unix-läget är det mest säkra sättet att köra Interchange, för det finns inget sätt för system på Internet att interagera med Interchange-servern.
vi: Chế độ Unix là cách bảo mật nhất để chạy Interchange, vì không cho phép hệ thống trên Mạng cách nào tương tác với trình phục vụ Interchange.

source: Username to run the server as:
it: Nome utente da utilizzare per eseguire il server:
sv: Användarnamn att köra servern som:
vi: Tên người dùng sẽ chạy trình phục vụ ấy:

source: This determines the user for the interchange server and for file permissions. Please note that using another user has serious security implications. Don't choose root, it is not recommended and will be discarded anyway.
it: Questo determina l'utente per il server Interchange e per i permessi sui file. Si noti che l'utilizzo di un altro utente ha serie implicazioni in tema di sicurezza. Non si scelga root, non è raccomandato e comunque la scelta sarà rifiutata.
sv: Detta bestämmer användaren för Interchange-servern och för filrättigheter. Notera att använda en annan användare innebär allvarliga säkerhetsrisker. Välj inte root, det är inte rekommenderat och kommer att ignoreras.
vi: Tùy chọn này quyết định người dùng cho trình phục vụ Interchange và cho quyền truy cập tập tin. Hãy ghi chú rằng sử dụng một người dùng khác ở đây thì rất rủi ro bảo mật. Đừng chọn người dùng chủ (root) vì không khuyên tùy chọn ấy và sẽ hủy nó bằng mọi giá.

source: Create the user ${USER}?
it: Creare l'utente ${USER}?
sv: Skapa användaren ${USER}?
vi: Tạo người dùng ${USER} không?

source: Impossible to run interchange as root !
it: Impossibile eseguire Interchange come root!
sv: Omöjligt att köra interchange som root!
vi: ••• Không cho phép chạy Interchange với tư cách người chủ. •••

source: You have been warned. Either choose an appropriate user or stay with the default.
it: Siete stati avvisati. Scegliere l'utente appropriato, o alternativamente lasciare l'utente predefinito.
sv: Du har blivit varnad. Välj antingen en lämplig användare eller fortsätt med förvalda användaren.
vi: Bạn đã được cảnh báo rồi. Hoặc chọn một người dùng thích hợp, hoặc sử dụng mặc định.

source: Group name to run the server as:
it: Nome del gruppo da utilizzare per eseguire il server:
sv: Gruppnamn att köra servern som:
vi: Tên nhóm sẽ chạy trình phục vụ ấy:

source: This determines the group for the interchange server and for file permissions. Please note that using another user has serious security implications. Don't choose root, it is not recommended and will be discarded anyway.
it: Questo determina il gruppo per il server Interchange e per i permessi sui file. Si noti che l'utilizzo di un altro utente ha serie implicazioni in tema di sicurezza. Non si scelga root, non è raccomandato e comunque la scelta sarà rifiutata.
sv: Detta bestämmer gruppen för Interchange-servern och för filrättigheter. Notera att använda en annan användare innebär allvarliga säkerhetsrisker. Välj inte root, det är inte rekommenderat och kommer att ignoreras.
vi: Tùy chọn này quyết định nhóm cho trình phục vụ Interchange và cho quyền truy cập tập tin. Hãy ghi chú rằng sử dụng một người dùng khác ở đây thì rất rủi ro bảo mật. Đừng chọn người dùng chủ (root) vì không khuyên tùy chọn ấy và sẽ hủy nó bằng mọi giá.

source: You have been warned. Either choose an appropriate group or stay with the default.
it: Siete stati avvisati. Scegliere il gruppo appropriato, o alternativamente lasciare il gruppo predefinito.
sv: Du har blivit varnad. Välj antingen en lämplig grupp eller fortsätt med förvalda gruppen.
vi: Bạn đã được cảnh báo rồi. Hoặc chọn một nhóm thích hợp, hoặc sử dụng mặc định.

source: Create the group ${GROUP}?
it: Creare il gruppo ${GROUP}?
sv: Skapa gruppen ${GROUP}?
vi: Tạo nhóm ${GROUP} không?

source: Static HTML files location:
it: Locazione dei file HTML statici:
sv: Plats för statiska HTML-filer:
vi: Ví trị của tập tin HTML tĩnh:

source: Catalog installations need a directory where HTML files can be placed.
it: Le installazioni di cataloghi necessitano di una directory in cui i file HTML possono essere memorizzati.
sv: Kataloginstallationer behöver en katalog där HTML-filer kan placeras.
vi: Bản cài đặt phân loại cần một thư mục nơi có thể để tập tin HTML.

source: Directory for GnuPG public keyring:
it: Directory per la chiave pubblica GnuPG:
sv: Katalog för GnuPG:s publika nyckelring:
vi: Thư mục cho vòng chìa khóa công GnuPG:

source: For enhanced security, credit card information retrieved from customers will be encrypted and mailed to the shop owner instead of storing it on the server.
it: Per potenziare la sicurezza, le informazioni fornite dai clienti sulle carte di credito vengono criptate e inviate per e-mail al proprietario del negozio, anziché essere memorizzate sul server.
sv: För ökad säkerhet kommer kreditkortsinformation hämtas från kunder att krypteras och e-postas till butiksägaren istället för att lagras på servern.
vi: Để tăng cường bảo mật, mọi thông tin về thẻ tín dụng mà người khách đã cung cấp thì sẽ được mật mã hóa và gửi trong thư cho người chủ hàng, thay vào lưu nó trên máy phục vụ.

source: Please choose the directory Interchange uses for the GnuPG public keyring.
it: Scegliere la directory che Interchange userà per la chiave pubblica GnuPG.
sv: Välj katalogen som Interchange använder för GnuPG:s publika nyckelring.
vi: Hãy chọn thư mục mà Interchange sẽ sử dụng cho vòng chìa khóa công GnuPG:

source: low, high, rpc
it: basso, alto, rpc
sv: låg, hög, rpc
vi: thấp, cao, RPC

source: Set of server parameters:
it: Insieme di parametri del server:
sv: Ställ in serverparametrar:
vi: Bộ tham số máy phục vụ

source: You can choose different sets of server parameters. Any store based on the foundation demo will change its behaviour too. If rpc is selected, the Interchange server will run in PreFork mode.
it: Si possono scegliere differenti insiemi di parametri del server. Anche tutti i negozi basati sulla fondazione demo cambieranno il proprio comportamento. Se si sceglie rpc, il server Interchange sarà eseguito in modo PreFork.
sv: Du kan välja andra uppsättningar av serverparametrar. Alla butiker baserade på grundläggande demonstationen kommer att ändra sitt uppträdade också. Om rpc väljs, kommer Interchange-servern att köras i PreFork-läget.
vi: Bạn có thể chọn một số bộ tham số khác cho máy phục vụ. Thì hàng nào đựa vào chứng minh cơ bản sẽ cũng thay đổi hành vi. Nếu chọn RPC thì máy phục vụ Interchange sẽ chạy trong chế độ PreFork.

source: Enable the FullURL directive?
it: Abilitare la direttiva FullURL?
sv: Aktivera direktivet FullURL?
vi: Bật chỉ thị FullURL không?

source: This setting determines if the whole URL is considered while checking for the corresponding catalog.
it: Questa impostazione determina se tutto l'URL è considerato per il controllo del catalogo corrispondente.
sv: Denna inställning bestämmer om hela URL:en ska beaktas vid kontroll efter lämplig katalog.
vi: Thiết lập này quyết định nếu sẽ tra cứu toàn địa chỉ Mạng khi kiểm tra phân loại tương ứng.

source: SOAP server not available
it: Server SOAP non disponibile
sv: SOAP-server finns inte tillgänglig
vi: Máy phục vụ SOAP chưa sẵn sàng.

source: Because the Perl module SOAP::Lite is not installed, you are unable to run the Interchange SOAP server. To change this, install the libsoap-lite-perl Debian package and run interchangeconfig SOAP=1.
it: Poiché il modulo Perl SOAP::Lite non è installato, non è possibile eseguire il server SOAP di Interchange. Per modificare questa situazione, installare il pacchetto Debian libsoap-lite-perl ed eseguire interchangeconfig SOAP=1.
sv: På grund av att Perl-modulen SOAP::Lite inte är installerad, kan du inte köra Interchanges SOAP-server. För att ändra detta, installera Debian-paketet libsoap-lite-perl och kör interchangeconfig SOAP=1.
vi: Vì chưa cài đặt mô-đun Perl SOAP::Lite, lúc này bạn không thể chạy máy phục vụ SOAP Interchange. Để sửa đổi trường hợp này, bạn có thể cài đặt gói tin «libsoap-lite-perl» rồi chạy «interchangeconfig SOAP=1».

source: Enable the SOAP server?
it: Abilitare il server SOAP?
sv: Aktivera SOAP-servern?
vi: Bật máy phục vụ SOAP không?

source: This setting determines if the SOAP server is started or not.
it: Questa impostazione determina se il server SOAP viene avviato o meno.
sv: Denna inställningar bestämmer om SOAP-servern är startad eller inte.
vi: Thiết lập quyết định nếu khởi động máy phục vụ SOAP hay không.

source: Enable robots settings?
it: Abilitare le impostazioni robot?
sv: Aktivera robotinställningar?
vi: Bật thiết lập rô-bốt không?

source: The Interchange Debian package uses a separate configuration file /etc/interchange/robots.cfg for the directives RobotUA, RobotIP and RobotHost. It is recommended to include these settings so that Interchange can distinguish between robots and ordinary users.
it: Il pacchetto Debian di Interchange usa un file di configurazione separato, /etc/interchange/robots.cfg, per le direttive RobotUA, RobotIP e RobotHost. Si raccomanda di includere queste impostazioni in modo che Interchange possa distinguere fra robot e utenti ordinari.
sv: Debian-paketet för Interchange använder en separat konfigurationsfil, /etc/interchange/robots.cfg för direktiven RobotUA, RobotIP och RobotHost. Det rekommenderas att inkludera dessa inställningar så att Interchange kan skilja mellan robotar och vanliga användare.
vi: Gói tin Debian tên Interchange dùng một tập tin cấu hình riêng «/etc/interchange/robots.cfg» cho những chỉ thị «RobotUA», «RobotIP» và «RobotHost». Khuyên khích bạn bao gồm những thiết lập này, để cho phép Interchange phân biệt giữa rô-bốt và người dùng thường.

source: Default language for user interface:
it: Lingua predefinita per l'interfaccia utente:
sv: Förvalt språk för användargränssnitt:
vi: Ngôn ngữ mặc định cho giao diện người dùng:

source: The administration interface for Interchange catalogs, called UI, has been translated to Danish (da_DK), Dutch (nl_NL), German (de_DE), Italian (it_IT) and Swedish (sv_SE). You can choose the default language here. Any user may change this default at login time.
it: L'interfaccia dell'amministrazione dei cataloghi Interchange, chiamata UI, è stata tradotta in danese (da_DK), olandese (nl_NL), tedesco (de_DE), italiano (it_IT) e svedese (sv_SE). Si può scegliere la lingua predefinita fra queste. Ogni utente può cambiare la propria lingua predefinita al momento dell'accesso.
sv: Administrationsgränssnittet för Interchanges kataloger, kallad UI, har översatts till Danska (da_DK), Holländska (nl_NL), Tyska (de_DE), Italienska (it_IT) och Svenska (sv_SE). Du kan välja det förvalda språket här. Alla användare kan ändra denna inställning vid inloggning.
vi: Giao diện quản lý cho phân loại Interchange, được gọi là UI, đã được dịch sang tiếng Đan-mạch (da-DK), tiếng Hoà-lan (nl-NL), tiếng Đức (de-DE), tiếng Ý (it-IT) và tiếng Thụy-điển (sv-SE). Ở đây thì bạn có thể chọn ngôn ngữ mặc định. Bất cứ người dùng có thể sửa đổi mặc định này khi đăng nhập.

source: Important Perl Incompatibility
sv: Viktig information om inkompatibilitet med Perl
vi: Trường hợp không tương thích với Perl quan trọng

source: The authors of Interchange strongly disencourage the use of their software on top of a thread enabled Perl. It is likely to cause serious problems, especially in high load situations, and has no benefit at all for Interchange servers. The development team asserts that the thread-safeness of Perl and the bunch of modules Interchange uses can hardly be relied upon. Please use this package only for testing and debugging purposes.
sv: Upphovsmännen av Interchange tar avstånd från användning av deras programvara på toppen av Perl som är trådaktiverad. Det är möjligt att allvarliga problem uppstår, speciellt vid situationer med hög belastning och har inga fördelar alls för Interchange-servrar. Utvecklingslaget försäkrar att trådsäkerheten i Perl och den samling av moduler som Interchange använder inte bör anses som pålitliga. Använd endast detta paket för test och felsökning.
vi: Những tác giả của Interchange khuyến khích một cách mạnh mọi người dùng không sử dụng phần mềm họ trên một mạch có Perl bật. Nó rất có thể sẽ gây ra vấn đề lớn, và sẽ không có kết quả tốt nào cho máy phục vụ Interchange. Nhóm phát triển xác nhận rằng bạn không thể nhờ hành vi của Perl với mạch và những mô-đun mà Interchange dùng. Hãy sử dùng gói tin này •chỉ• cho mục đích gỡ lỗi và kiểm tra.
